unitTests/ITHACAsurfacetools/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0.0495";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
300
(
(4.3835 0.378155 0)
(4.06274 0.502681 0)
(3.43886 0.404068 0)
(2.8417 0.284523 0)
(2.42657 0.181669 0)
(2.15114 0.105712 0)
(1.96522 0.0579704 0)
(1.84029 0.0317224 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWallsLeft
    {
        type            noSlip;
    }
    fixedWallsRight
    {
        type            noSlip;
    }
    frontAndBackLeft
    {
        type            empty;
    }
    frontAndBackRight
    {
        type            empty;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 10((1.66259 0.0728993 0) (4.24936 0.114087 0) (5.82185 0.17936 0) (6.52527 0.157219 0) (6.74186 0.0606261 0) (6.74186 -0.0606262 0) (6.52527 -0.157219 0) (5.82185 -0.17936 0) (4.24936 -0.114087 0) (1.66259 -0.0728993 0));
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
20
(
(1.32178 0.0862951 0)
(2.0034 0.0595035 0)
(4.03247 0.095186 0)
(4.46626 0.132987 0)
(5.70897 0.170694 0)
(5.93474 0.188026 0)
(6.48083 0.160946 0)
(6.56971 0.153491 0)
(6.73162 0.0699427 0)
(6.7521 0.0513096 0)
(6.7521 -0.0513097 0)
(6.73162 -0.0699428 0)
(6.56971 -0.153492 0)
(6.48083 -0.160946 0)
(5.93474 -0.188026 0)
(5.70897 -0.170694 0)
(4.46626 -0.132987 0)
(4.03247 -0.095186 0)
(2.0034 -0.0595035 0)
(1.32178 -0.0862951 0)
)
;
    }
}


// ************************************************************************* //
