unitTests/ITHACAsurfacetools/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location	"0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
    	type            fixedValue;
        value           uniform 0;
    }
    
    fixedWallsLeft
    {
    	type		zeroGradient;
    }
    
    fixedWallsRight
    {
    	type		zeroGradient;
    }

    frontAndBackLeft
    {
        type            empty;
    }
    
    frontAndBackRight
    {
        type            empty;
    }
    
    left
    {
    	type		cyclicAMI;
    }
    
    right
    {
    	type		cyclicAMI;
    }
}


// ************************************************************************* //
